In [1]:
import pandas as pd

In [5]:
name = ["Gaurav", "anupam", "javed", "madhu", "anumeha", "sandeep"]
scores = [9,8,7.5,8,9,10]
rating = [5,3,5,4,4.5,3.5]

In [8]:
students_dict = {"Names": name, "Scores": scores, "Ratings": rating}

In [9]:
students = pd.DataFrame(students_dict)

In [10]:
students

     Names  Scores  Ratings
0   Gaurav     9.0      5.0
1   anupam     8.0      3.0
2    javed     7.5      5.0
3    madhu     8.0      4.0
4  anumeha     9.0      4.5
5  sandeep    10.0      3.5

In [11]:
type(students)

pandas.core.frame.DataFrame

In [13]:
type(students['Scores'])

pandas.core.series.Series

In [14]:
students[['Scores','Ratings']]

   Scores  Ratings
0     9.0      5.0
1     8.0      3.0
2     7.5      5.0
3     8.0      4.0
4     9.0      4.5
5    10.0      3.5

In [40]:
a = pd.read_csv("ex1.csv", header= None, =[4,5,6,7])

In [41]:
a

    4   5   6        7
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [22]:
a.head(2)

   0  1  2  3        4
0  a  b  c  d  message
1  1  2  3  4    hello

In [23]:
a.tail(2)

   0   1   2   3      4
2  5   6   7   8  world
3  9  10  11  12    foo

In [24]:
a.dtypes

0    object
1    object
2    object
3    object
4    object
dtype: object

In [25]:
students.dtypes

Names       object
Scores     float64
Ratings    float64
dtype: object

In [27]:
pd.read_table("test.tsv", header=None)

       0      1      2      3      4      5
0   sudh   sudh   sudh   sudh   sudh   sudh
1  kumar  kumar  kumar  kumar  kumar  kumar

In [31]:
pd.read_csv("test.tsv", header=None, sep='\t')

       0      1      2      3      4      5
0   sudh   sudh   sudh   sudh   sudh   sudh
1  kumar  kumar  kumar  kumar  kumar  kumar

In [34]:
b = pd.read_csv("ex4.csv", skiprows=[0,2,3])

In [35]:
b

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [36]:
students

     Names  Scores  Ratings
0   Gaurav     9.0      5.0
1   anupam     8.0      3.0
2    javed     7.5      5.0
3    madhu     8.0      4.0
4  anumeha     9.0      4.5
5  sandeep    10.0      3.5

In [77]:
students.shape

(6, 3)

In [78]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Names      6 non-null object
Scores     6 non-null float64
Ratings    6 non-null float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [79]:
students.describe()

          Scores   Ratings
count   6.000000  6.000000
mean    8.583333  4.166667
std     0.917424  0.816497
min     7.500000  3.000000
25%     8.000000  3.625000
50%     8.500000  4.250000
75%     9.000000  4.875000
max    10.000000  5.000000

In [37]:
a

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [44]:
students.to_csv("students.csv", sep="@")

In [43]:
pwd()

'C:\\Users\\SHIVAM SINGH\\Documents\\Python Online Session\\Pandas_in_Depth'

In [45]:
s = pd.Series(["trainer", "ML", 23,96,"rating",49], index=["shivam", "DL", "DOB", 56, 5, 16])

In [46]:
s

shivam    trainer
DL             ML
DOB            23
56             96
5          rating
16             49
dtype: object

In [47]:
s['DL']

'ML'

In [49]:
s[56]

96

In [50]:
import csv

In [53]:
f = open("ex7.csv")

In [56]:
f

In [54]:
c = csv.reader(f)

In [55]:
c

In [57]:
for i in c:
    print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [58]:
with open ("ex7.csv") as f:
    lines = list(csv.reader(f))

In [59]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [60]:
a = [4,5,6,7]
b = [3,4,6]
c = [3,9,10]

In [61]:
list(zip(a,b,c))

[(4, 3, 3), (5, 4, 9), (6, 6, 10)]

In [62]:
lines[1:]

[['1', '2', '3'], ['1', '2', '3']]

In [69]:
list(zip(lines[1],lines[2]))

[('1', '1'), ('2', '2'), ('3', '3')]

In [66]:
k, v = lines[0], lines[1:]

In [67]:
k

['a', 'b', 'c']

In [68]:
v

[['1', '2', '3'], ['1', '2', '3']]

In [75]:
list(zip(*v))

[('1', '1'), ('2', '2'), ('3', '3')]

In [76]:
{k : v for k,v in zip(k, zip(*v))}

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [1]:
from numpy.random import randn as rn

In [11]:
import numpy as np
import pandas as pd
np.random.seed(100)
r = rn(5,4)

In [12]:
r

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [15]:
df = pd.DataFrame(r, index = ["A","B","C","D","E"], columns = ["w","x","y","z"])

In [16]:
df

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [17]:
df["new"] = df["w"] + df["x"]

In [18]:
df

          w         x         y         z       new
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [23]:
df.drop("new", axis=1, inplace=True)

In [24]:
df

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [26]:
df.loc[["C","D"]]

          w         x         y         z
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [28]:
df.iloc[[2,3]]

          w         x         y         z
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [29]:
df.loc[["C","D"], ["x","y"]]

          x         y
C  0.255001 -0.458027
D  0.816847  0.672721

In [30]:
df.iloc[[2,3], [1,2]]

          x         y
C  0.255001 -0.458027
D  0.816847  0.672721

In [31]:
df.iloc[0:3, 2:]

          y         z
A  1.153036 -0.252436
B  0.221180 -1.070043
C -0.458027  0.435163

In [33]:
df.ix[[0,1]]

C:\Users\SHIVAM SINGH\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043

In [34]:
df.ix[["A", "B"]]

C:\Users\SHIVAM SINGH\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043

In [35]:
df.ix[2:,['w']]

C:\Users\SHIVAM SINGH\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\SHIVAM SINGH\Anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

          w
C -0.189496
D -0.583595
E -0.531280

In [36]:
df>0

       w     x      y      z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [37]:
df[df>0]

          w         x         y         z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [38]:
df[df.loc[["A","B","C"]]>0]

          w         x         y         z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN

In [39]:
df

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [41]:
df.reset_index(drop=True)

          w         x         y         z
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [42]:
df

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [44]:
df.set_index('z', inplace=True)

In [45]:
df

                  w         x         y
z
-0.252436 -1.749765  0.342680  1.153036
-1.070043  0.981321  0.514219  0.221180
 0.435163 -0.189496  0.255001 -0.458027
-0.104411 -0.583595  0.816847  0.672721
-1.118318 -0.531280  1.029733 -0.438136

In [47]:
df.index

Float64Index([-0.25243603652138985,  -1.0700433305682933,  0.43516348812289213,
              -0.10441114339062771,  -1.1183182462554362],
             dtype='float64', name='z')

In [48]:
df.loc[-0.25243603652138985]

w   -1.749765
x    0.342680
y    1.153036
Name: -0.25243603652138985, dtype: float64

In [49]:
l = "shivam singh xyz abc dob"

In [50]:
df

                  w         x         y
z
-0.252436 -1.749765  0.342680  1.153036
-1.070043  0.981321  0.514219  0.221180
 0.435163 -0.189496  0.255001 -0.458027
-0.104411 -0.583595  0.816847  0.672721
-1.118318 -0.531280  1.029733 -0.438136

In [51]:
df['n'] = l.split()

In [52]:
df

                  w         x         y       n
z
-0.252436 -1.749765  0.342680  1.153036  shivam
-1.070043  0.981321  0.514219  0.221180   singh
 0.435163 -0.189496  0.255001 -0.458027     xyz
-0.104411 -0.583595  0.816847  0.672721     abc
-1.118318 -0.531280  1.029733 -0.438136     dob

In [53]:
data = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,6,np.nan], 'C':[np.nan,7,8]})

In [54]:
data

     A    B    C
0  1.0  5.0  NaN
1  2.0  6.0  7.0
2  NaN  NaN  8.0

In [55]:
data.dropna()

     A    B    C
1  2.0  6.0  7.0

In [62]:
data.dropna(thresh=1)

     A    B    C
0  1.0  5.0  NaN
1  2.0  6.0  7.0
2  NaN  NaN  8.0

In [63]:
data.fillna(7)

     A    B    C
0  1.0  5.0  7.0
1  2.0  6.0  7.0
2  7.0  7.0  8.0

In [64]:
data.fillna(data['A'].mean())

     A    B    C
0  1.0  5.0  1.5
1  2.0  6.0  7.0
2  1.5  1.5  8.0

In [65]:
d = {'name': ["shivam", "anupam", "gaurav", "javed", "madhu", "sanjeev"],
    'salary': [10000,2000,1000,4000,3000,5000],
    'company': ["aiml", "itss", "seldom", "iutkarsh", "acadview", "xpertup"]}

In [66]:
d

{'name': ['shivam', 'anupam', 'gaurav', 'javed', 'madhu', 'sanjeev'],
 'salary': [10000, 2000, 1000, 4000, 3000, 5000],
 'company': ['aiml', 'itss', 'seldom', 'iutkarsh', 'acadview', 'xpertup']}

In [67]:
df1 = pd.DataFrame(d)

In [68]:
df1

      name  salary   company
0   shivam   10000      aiml
1   anupam    2000      itss
2   gaurav    1000    seldom
3    javed    4000  iutkarsh
4    madhu    3000  acadview
5  sanjeev    5000   xpertup

In [72]:
df2 = df1.groupby('name').describe()

In [73]:
df2

        salary
         count     mean std      min      25%      50%      75%      max
name
anupam     1.0   2000.0 NaN   2000.0   2000.0   2000.0   2000.0   2000.0
gaurav     1.0   1000.0 NaN   1000.0   1000.0   1000.0   1000.0   1000.0
javed      1.0   4000.0 NaN   4000.0   4000.0   4000.0   4000.0   4000.0
madhu      1.0   3000.0 NaN   3000.0   3000.0   3000.0   3000.0   3000.0
sanjeev    1.0   5000.0 NaN   5000.0   5000.0   5000.0   5000.0   5000.0
shivam     1.0  10000.0 NaN  10000.0  10000.0  10000.0  10000.0  10000.0

In [74]:
df2['salary']['mean']

name
anupam      2000.0
gaurav      1000.0
javed       4000.0
madhu       3000.0
sanjeev     5000.0
shivam     10000.0
Name: mean, dtype: float64

In [76]:
df3 = df2.loc['shivam']

In [77]:
df3

salary  count        1.0
        mean     10000.0
        std          NaN
        min      10000.0
        25%      10000.0
        50%      10000.0
        75%      10000.0
        max      10000.0
Name: shivam, dtype: float64

In [78]:
df3.loc['salary'].loc['mean']

10000.0

In [79]:
df4 = pd.DataFrame(df1.groupby('name').describe().loc['shivam'])

In [80]:
df4

               shivam
salary count      1.0
       mean   10000.0
       std        NaN
       min    10000.0
       25%    10000.0
       50%    10000.0
       75%    10000.0
       max    10000.0

In [81]:
daf1 = pd.DataFrame({'A': [2,3,4,5,6],
                    'B': [5,6,7,8,9],
                    'C': [10,11,12,13,14]},
                    index = [0,1,2,3,4])

In [82]:
daf1

   A  B   C
0  2  5  10
1  3  6  11
2  4  7  12
3  5  8  13
4  6  9  14

In [83]:
daf2 = pd.DataFrame({'A': [2,3,4,5,6],
                    'B': [5,6,7,8,9],
                    'C': [10,11,12,13,14]},
                    index = [5,6,7,8,9])

In [84]:
daf3 = pd.DataFrame({'A': [2,3,4,5,6],
                    'B': [5,6,7,8,9],
                    'C': [10,11,12,13,14]},
                    index = [10,11,12,13,14])

In [85]:
daf2

   A  B   C
5  2  5  10
6  3  6  11
7  4  7  12
8  5  8  13
9  6  9  14

In [86]:
daf3

    A  B   C
10  2  5  10
11  3  6  11
12  4  7  12
13  5  8  13
14  6  9  14

In [88]:
pd.concat([daf1, daf2, daf3], axis=1)

      A    B     C    A    B     C    A    B     C
0   2.0  5.0  10.0  NaN  NaN   NaN  NaN  NaN   NaN
1   3.0  6.0  11.0  NaN  NaN   NaN  NaN  NaN   NaN
2   4.0  7.0  12.0  NaN  NaN   NaN  NaN  NaN   NaN
3   5.0  8.0  13.0  NaN  NaN   NaN  NaN  NaN   NaN
4   6.0  9.0  14.0  NaN  NaN   NaN  NaN  NaN   NaN
5   NaN  NaN   NaN  2.0  5.0  10.0  NaN  NaN   NaN
6   NaN  NaN   NaN  3.0  6.0  11.0  NaN  NaN   NaN
7   NaN  NaN   NaN  4.0  7.0  12.0  NaN  NaN   NaN
8   NaN  NaN   NaN  5.0  8.0  13.0  NaN  NaN   NaN
9   NaN  NaN   NaN  6.0  9.0  14.0  NaN  NaN   NaN
10  NaN  NaN   NaN  NaN  NaN   NaN  2.0  5.0  10.0
11  NaN  NaN   NaN  NaN  NaN   NaN  3.0  6.0  11.0
12  NaN  NaN   NaN  NaN  NaN   NaN  4.0  7.0  12.0
13  NaN  NaN   NaN  NaN  NaN   NaN  5.0  8.0  13.0
14  NaN  NaN   NaN  NaN  NaN   NaN  6.0  9.0  14.0

In [89]:
df1 = pd.DataFrame({'key1': ['k1', 'k2', 'k3', 'k4'],
                   'x': [1,2,3,4],
                   'y': [5,6,7,8]})

In [93]:
df2 = pd.DataFrame({'key1': ['k1', 'k5', 'k3', 'k8'],
                   'a': [1,2,13,4],
                   'b': [15,26,17,8]})

In [94]:
df1

  key1  x  y
0   k1  1  5
1   k2  2  6
2   k3  3  7
3   k4  4  8

In [95]:
df2

  key1   a   b
0   k1   1  15
1   k5   2  26
2   k3  13  17
3   k8   4   8

In [99]:
pd.merge(df1,df2, how="right")

  key1    x    y   a   b
0   k1  1.0  5.0   1  15
1   k3  3.0  7.0  13  17
2   k5  NaN  NaN   2  26
3   k8  NaN  NaN   4   8

In [100]:
train = pd.read_csv("train.csv")

In [101]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [104]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [107]:
train[train['Sex'] == 'male']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q